export type CollegeDept = {
  college: string;
  departments: string[];
};

export const dankookJukjeon: CollegeDept[] = [
  {
    college: "문과대학",
    departments: ["국어국문학과", "사학과", "철학과", "영미인문학과"],
  },
  {
    college: "법과대학",
    departments: ["법학과"],
  },
  {
    college: "사회과학대학",
    departments: [
      "정치외교학과",
      "행정학과",
      "도시계획·부동산학부 도시지역계획학전공",
      "도시계획·부동산학부 부동산학전공",
      "미디어커뮤니케이션학부 저널리즘전공",
      "미디어커뮤니케이션학부 영상콘텐츠전공",
      "미디어커뮤니케이션학부 광고홍보전공",
      "상담학과",
    ],
  },
  {
    college: "경영경제대학",
    departments: [
      "경제학과",
      "무역학과",
      "경영학부 경영학전공",
      "경영학부 회계학전공",
      "산업경영학과(야)",
    ],
  },
  {
    college: "공과대학",
    departments: [
      "전자전기공학과",
      "융합반도체공학과",
      "고분자시스템공학부 고분자공학전공",
      "고분자시스템공학부 파이버융합소재공학전공",
      "토목환경공학과",
      "기계공학과",
      "화학공학과",
      "건축학부 건축학전공",
      "건축학부 건축공학전공",
    ],
  },
  {
    college: "SW융합대학",
    departments: [
      "소프트웨어학과",
      "컴퓨터공학과",
      "통계데이터사이언스학과",
      "사이버보안학과",
      "SW융합학부",
    ],
  },
  {
    college: "사범대학",
    departments: [
      "한문교육과",
      "특수교육과",
      "수학교육과",
      "과학교육과",
      "체육교육과",
      "교직교육과",
    ],
  },
  {
    college: "음악·예술대학",
    departments: [
      "도예과",
      "디자인학부 커뮤니케이션디자인전공",
      "디자인학부 패션산업디자인전공",
      "공연영화학부 연극전공",
      "공연영화학부 영화전공",
      "공연영화학부 뮤지컬전공",
      "무용과",
      "음악학부 피아노전공",
      "음악학부 관현악전공",
      "음악학부 성악전공",
      "음악학부 작곡전공",
      "음악학부 국악전공",
    ],
  },
  {
    college: "프리무스국제대학",
    departments: [
      "국제경영학과",
      "모바일시스템공학과",
      "바이오소재융합공학과",
      "한국학과",
      "연기영상예술학과",
      "글로벌기초교육학부",
    ],
  },
];
